// learn_js/面向对象/object

// ======================================================================================

// 在ECMAScript-262中，对象被定义为“无序属性的集合，其属性可以包含基本值，对象或者函数”。
// 也就是说，在JavaScript中，对象无非就是由一些列无序的key-value对组成。其中value可以是基本值，对象或者函数。

// 这里的person就是一个对象
var person = {
    name: 'Tom',
    age: 18,
    getName: function() {},
    parent: {}
}

// ======================================================================================

// 创建对象
// 我们可以通过new的方式创建一个对象。

var obj = new Object();
// 也可以通过对象字面量的形式创建一个简单的对象。

var obj = {};

// ======================================================================================

// 当我们想要给我们创建的简单对象添加方法时，可以这样表示。

// 可以这样
var person = {};
person.name = "TOM";
person.getName = function() {
    return this.name;
}

// 也可以这样
var person = {
    name: "TOM",
    getName: function() {
        return this.name;
    }
}

// ======================================================================================

// 当我们想要访问他的name属性时，可以用如下两种方式访问。

person.name

// 或者
person['name']

// 如果我们想要访问的属性名是一个变量时，常常会使用第二种方式。例如我们要同时访问person的name与age，可以这样写：

['name', 'age'].forEach(function(item) {
    console.log(person[item]);
})

// ======================================================================================

